import { useState } from 'react'
import css from './About.module.scss'
const About = () => {
	const [show, setShow] = useState(false)
	const clickHandler = () => {
		if (!show) {
			return setShow(true)
		}
		return setShow(false)
	}
	const textClass = show ? `${css.text} ${css.showMore}` : css.text
	return (
		<section className={css.about}>
			<div className={`container ${css.aboutWrapper}`}>
				<h2 className="visually-hidden">Інфомрація про нас</h2>
				<p className={textClass}>
					Інтернет-магазин дитячих товарів Бу-Бу - зона комфорту малюків і їх батьків. Наш
					асортимент розроблений в діапазоні "від народження до школи", завдяки чому кожен етап
					розвитку вашої дитини буде максимально правильним, а головне, цікавим і радісним. <br />
					<br />
					Товари для дітей - особлива категорія продукції, тому ми довіряємо тільки перевіреним
					виробникам та брендам, які давно і успішно представлені на світовому ринку. Магазин Бу-Бу
					є дистриб'ютором таких брендів: Anex, X-lander, Leonardo, Bebe Confort, Welldon, Huffy,
					Fun Time, Lexus Trike, Nino, Maltex, Ceba baby, X-rider, Play WOW, Miniland, Casato,
					Klups, Radir, Keenway, Adamex, Roan, Tako. <br />
					<br />
					На сайті інтернет магазину Бу-Бу ви можете купити товари для дітей абсолютно різних
					категорій, в залежності від потреб: дитячі коляски, дитяча кімната, стільці і шезлонги,
					все для годування, гігієна та догляд, автокрісла, дитячий транспорт, іграшки, дитячий
					одяг. Одним з найскладнішим є вибір коляски для новонародженого, а потім і прогулянкової.
					Саме тому в асортимент магазину Бу-Бу увійшли дитячі коляски різної комплектації і
					модифікації: коляски 2в1, коляски 3в1, аксесуари та комплектуючі, класичні коляски,
					коляски для двійні; Коляски-книжки; Коляски-тростини. В картці товару ви можете знайти
					опис коляски і виробника, ознайомитися з характеристиками, почитати відгуки покупців, щоб
					точно визначитися, якою має бути саме ваша коляска для малюка.
					<br />
					<br /> "Дитяча кімната" в інтернет магазині Бу-Бу - це зручно, функціонально і красиво:
					дитячі ліжечка, дитяче постільна білизна, ковдри та наматрацники, комоди і шафи, техніка
					для дітей. Також у Бу-Бу знають, що щасливі батьки - це батьки здорового і ситого малюка.
					В категорії "Стільці і шезлонги" ви знайдете все для міцного сну і відмінного годування:
					стільчики для годування, багатофункціональні стільчики, аксесуари для стільчиків, дитячі
					шезлонги, вколисуючі центри, дерев'яні стільчики для годування, столики і стільчики.
					<br />
					<br />
					Товари для дітей - тема цікава і дуже велика, якщо не сказати, нескінченна. Тому в нашому
					асортименті також є: поїльники і непроливайки, термоконтейнери, ванночки для дітей, гірки
					та інші аксесуари для купання, горщики і сидіння для унітазу, автокрісла від 0 до 3 років,
					бустери, триколісні й двоколісні велосипеди, самокати і біговели, ходунки,
					рюкзаки-переноски і слінги, розвиваючі іграшки, набори для творчості та багато ін.
					важливих дитячих товарів. <br />
					<br />
					Купити дитячі товари в нашому інтернет-магазині дуже просто - перейдіть в розділ
					"Категорії", наповнюйте кошик і оформляйте замовлення 24/7. Задача Бу-Бу зробити
					максимально комфортним та безтурботним Ваше життя, і ми безмірно раді бути разом з Вами
					однією сім'єю!
				</p>
				<button className={css.button} onClick={clickHandler}>
					Докладніше
				</button>
			</div>
		</section>
	)
}
export default About
